{
    "about": {
        "name": "Paulo Bressan",
        "role": "Software Engineer",
        "summary": "I'm a Software Engineer with experience in creating impactful technological solutions. Passionate about open source, startups, and building impactful side projects. With solid skills in software development, I constantly seek innovative ways to leverage technology to drive the success of companies and causes I believe in.",
        "image": "/image.png"
    },
    "portfolio": {
        "projects": [
            {
                "name": "TxPipe",
                "image": "/txpipe.png",
                "summary": "Open-source software for a decentralized world. We believe that blockchain adoption can be accelerated by improving developer experience. We develop blockchain tools, leveraging the open-source community and its methodologies.",
                "link": "https://txpipe.io/",
                "tags": [
                    {
                        "text": "Rust",
                        "color": "red"
                    },
                    {
                        "text": "K8S",
                        "color": "green"
                    }
                ]
            },
            {
                "name": "Cardano Warriors",
                "image": "/cardano-warriors.png",
                "summary": "Cardano Warriors emerged with the goal of creating an exceptional NFT minting experience on the Cardano Blockchain. After the success of the initial launch, we decided to embark on the development of an immersive RPG game with native integration into the Cardano Blockchain. To achieve this, we initiated the development of a platform that enables the purchase of land within the world of Cardano Warriors. Following the successful launch of the platform, we introduced the first gameplay experience called Time Attack. From that stage onward, we focused our efforts on enhancing and developing the platform, creating a new minting engine and transaction management system specifically tailored for Cardano. We utilized Rust to implement the services, rabbitMQ for communication and messaging, Redis for cache storage, and Postgresql as the transactional database. The initial version of the game was built on the Unity Engine. After completing this revamp, our final major delivery was the implementation of a hybrid on-chain/off-chain store and inventory. In this store, players had the opportunity to acquire a game item called Stardust, a magical crystal that, when activated, releases randomly generated items with varying levels of rarity.",
                "link": "https://cardanowarriors.io/",
                "tags": [
                    {
                        "text": "Rust",
                        "color": "red"
                    },
                    {
                        "text": "Nodejs",
                        "color": "red"
                    },
                    {
                        "text": "VueJS",
                        "color": "green"
                    },
                    {
                        "text": "C#",
                        "color": "green"
                    },
                    {
                        "text": "AWS",
                        "color": "yellow"
                    }
                ]
            },
            {
                "name": "Batatais Food",
                "image": "/batatais-food.png",
                "summary": "The Batatais Food is an application that runs on top of the Orionlabs platform. The platform development involves a distributed architecture with over 20 services, including Core API, Backend API, Socket Server, and Print Server. These services were developed using NodeJS with MongoDB, Golang, and C#. The desktop Point of Sale (POS) and Print Client were developed using C# Windows Form, while the mobile POS and Marketplace APP were developed using Flutter. The administrative panels were built using VueJS, and finally, the ecommerce section, which required good SEO, was developed using NuxtJS. Currently, the platform has over 200 clients. In addition to B2C functionality, the platform also offers B2B capabilities for partners who wish to replicate our use case and resell our systems under their own brand.",
                "link": "https://www.batataisfood.com.br/",
                "tags": [
                    {
                        "text": "VueJS",
                        "color": "green"
                    },
                    {
                        "text": "NodeJS",
                        "color": "red"
                    },
                    {
                        "text": "Golang",
                        "color": "red"
                    },
                    {
                        "text": "C#",
                        "color": "red"
                    },
                    {
                        "text": "GCP",
                        "color": "yellow"
                    }
                ]
            },
            {
                "name": "Horus people flow counter",
                "image": "/horus.png",
                "summary": "Horus was created with the aim of counting the flow of people in physical stores. Therefore, a neural network model was used to detect people entering and exiting the stores, utilizing the store's security cameras with OpenCV to manipulate the frame. Thus, the input data of people was sent to a database, which was later transferred to Google's DataLake for analysis and cross-referencing with other data, such as sales data, generating analyses of promotional campaign results conducted in physical stores, as well as determining peak days or hours of store traffic, among other insights.",
                "tags": [
                    {
                        "text": "OpenCV",
                        "color": "yellow"
                    },
                    {
                        "text": "TensorFlow",
                        "color": "green"
                    },
                    {
                        "text": "Python",
                        "color": "red"
                    }
                ]
            },
            {
                "name": "Chromecast Discovery",
                "image": "/chromecast.png",
                "summary": "The Chromecast Discovery was developed with the purpose of assisting salespeople in physical stores to demonstrate products on larger screens through a sales application. In addition to enabling product streaming, the device also featured an idle function that activated after a few minutes of inactivity, displaying campaign media on the screens. Each physical store had a Linux server running an internal Python service responsible for managing all the Chromecasts in the store, allowing sales applications to transmit via an HTTP API. The server also operated a Multicast DNS service, eliminating the need for server IP configuration in the sales applications. To configure the campaigns to be displayed during idle times, an administrative panel was created, enabling the configuration of images and videos to be shown in each section of the store.",
                "tags": [
                    {
                        "text": "Python",
                        "color": "red"
                    }
                ]
            },
            {
                "name": "Remote seller",
                "image": "/remote-seller.png",
                "summary": "The Remote Salesperson was created to enable salespeople to work remotely during the Covid-19 pandemic. This allowed customers to access the nearest virtual store and choose a salesperson for assistance and making a purchase. The solution was developed using NuxtJS for the front-end and NodeJS for the Web API.",
                "link": "https://lojas.magazineluiza.com.br/nossos-vendedores",
                "tags": [
                    {
                        "text": "VueJS",
                        "color": "green"
                    },
                    {
                        "text": "NodeJS",
                        "color": "red"
                    }
                ]
            },
            {
                "name": "Maga Chat",
                "image": "/maga-chat.png",
                "summary": "Maga Chat was created to centralize conversations from a single WhatsApp number to multiple sellers. A single WhatsApp number was provided for customers to contact the sellers, so an API called Kraken was developed to validate the idea of sales through WhatsApp. This API was written in NodeJS and had direct integration with the WhatsApp Business service.",
                "tags": [
                    {
                        "text": "NodeJS",
                        "color": "red"
                    },
                    {
                        "text": "MongoDB",
                        "color": "yellow"
                    }
                ]
            }
        ]
    },
    "resume": {
        "experience": [
            {
                "startAt": "2023",
                "endAt": "present",
                "name": "Software Engineer • TxPipe",
                "summary": "Contribution to open source projects for the Cardano blockchain using rust as the main stack, manipulation blocks (Pallas), indexers(Scrolls), event bridger(Oura), and Demiter(Infrastructure provider)."
            },
            {
                "startAt": "2021",
                "endAt": "present (part-time)",
                "name": "Software Developer (Tech Leader) • Cardano Warriors",
                "summary": "I have led teams in developing DApps and games on the Cardano blockchain, specializing in NFT minting, simple transactions, and multisig. I have led innovative projects, such as an interactive game map using layered image processing with Python and rendering with Leaflet, blockchain/web3 e-commerce for selling game items, and hybrid on-chain/off-chain inventory. I successfully conducted the launch of a functional beta version of the game."
            },
            {
                "startAt": "2020",
                "endAt": "2022",
                "name": "Software Developer • Orion Labs/Batatais Food",
                "summary": "I led the development of a comprehensive platform for restaurant management, including the development of a web-based administrative panel, mobile point of sale (POS), desktop POS, e-commerce functionality, and support for creating white-label marketplaces for B2B."
            },
            {
                "startAt": "2019",
                "endAt": "2021",
                "name": "Software Developer (Pleno) • Luizalabs",
                "summary": "I created innovative products for physical stores using OpenCV and TensorFlow. I developed a flow counter for analyzing campaigns in physical stores and a TV pairing system for broadcasting advertisements."
            },
            {
                "startAt": "2018",
                "endAt": "2019",
                "name": "Software Developer (Pleno) • Idealeware/Citel",
                "summary": "I worked on the development of an e-commerce platform with integrations to various partners such as Mercado Livre, Hub2B, Correios, Pagarme, Mercado Pago, PagSeguro, among others."
            },
            {
                "startAt": "2015",
                "endAt": "2018",
                "name": "Software Developer/IT assistant • Implementos Agrícolas Marispan",
                "summary": "I worked on configuring corporate networks, maintaining data centers, providing computer support, and developing software using C#."
            }
        ],
        "education": [
            {
                "year": "2019",
                "name": "UNIP • MBA Data Science & Machine Learn"
            },
            {
                "year": "2017",
                "name": "UNIP • Analysis and development of systems."
            },
            {
                "year": "2015",
                "name": "ETEC • Systems development"
            }
        ],
        "skill": {
            "hard": [
                "Linux",
                "Devops (AWS, GCP)",
                "Cardano Blockchain"
            ],
            "soft": [
                "Leader",
                "Communication",
                "Adaptability",
                "Problem-solving"
            ],
            "tech": [
                "Rust",
                "NoSQL (MongoDB, Redis)",
                "Node JS/TS",
                "Vue JS/TS (NuxtJS)",
                "SQL (Postgresql, Mysql)",
                "Python (OpenCV, TensorFlow, DLib)",
                "Crypto (AES, RSA)",
                "Golang",
                "C#",
                "Haskell"
            ]
        }
    },
    "contact": {
        "email": "paulo.bressan@outlook.com",
        "github": "https://github.com/paulobressan",
        "linkedin": "https://www.linkedin.com/in/paulo-b-335501115/",
        "phone": "+5516994449951",
        "twitter": "https://twitter.com/Paulo_BressanJr"
    }
}